#!/usr/bin/env python
# -*- coding: utf-8 -*-


import time
from urllib2 import Request
import urllib2
from bs4 import BeautifulSoup
from DBHelper import *
from SoccerModels import *
from SoccerRound import *
import datetime

from SendMail import *
from SoccerRound import *

global AllGames
global AllBeginTimes



def anyaisegame(beginTimeStr, AllGames, AllBeginTimes):
    # global AllGames
    # global AllBeginTimes
    contentStr = ''
    for game in AllGames:
        if game.beginTime == beginTimeStr:
            game.oddCompanies = getOneGameODD(game)
            game.handiCompanies = getOneGameHandi(game)

            tempstr = getGameData(game)
            if tempstr != None:
                contentStr = contentStr + tempstr
                contentStr = contentStr + '\n'

            time.sleep(3)

    subjectstr = '时段足球分析'
    send_mail("%s %s" % (subjectstr, beginTimeStr), contentStr)
    del AllBeginTimes[0]
    if len(AllBeginTimes) > 0:
        runTask(anyaisegame, AllGames, AllBeginTimes)

def runTask(func, AllGames, AllBeginTimes):
# def runTask(func, day=0, hour=0, min=0, second=0):
    # get current time
    # now = datetime.now()
    # strnow = now.strftime('%Y-%m-%d %H:%M:%S')
    # print "now:", strnow
    # get net_run time
    # period = timedelta(days=0, hours=0, minutes=15, seconds=0)
    # next_time = now + period
    # strnext_time = next_time.strftime('%Y-%m-%d %H:%M:%S')
    # global AllGames
    # global AllBeginTimes

    timeStr = AllBeginTimes[0]
    print timeStr
    now = datetime.now()


    # period = timedelta(days=0, hours=0, minutes=15, seconds=0)
    # next_time = now - period
    # strnext_time = next_time.strftime('%Y-%m-%d %H:%M:%S')
    strnow = now.strftime('%Y-%m-%d %H:%M:%S')
    strnow = '2017-05-08 19:29'
    if timeStr < strnow:
        del AllBeginTimes[0]
        runTask(anyaisegame, AllGames, AllBeginTimes)
        return
    strnext_time = timeStr
    print "next run:", strnext_time
    while True:
        now = datetime.now()
        strnow = now.strftime('%Y-%m-%d %H:%M:%S')
        strnow = '2017-05-08 19:30'
        # if system time eq next_time run the specific task(hello func)
        if str(strnow) == str(strnext_time):
            print strnow
            func(str(strnow), AllGames, AllBeginTimes)
            break

def getTodaySoccer(type):
    # type == 3 精彩
    # type == 1 精简
    # type == 2 十四场
    type = int(type)
    try:
        url = "http://112.91.160.49:8071/phone/schedule_0_" + str(type) + ".txt?an=iosQiuTan&av=5.9&from=2&r="+str(int(time.time()))
        # url = "http://112.91.160.49:8071/phone/schedule_0_" + str(type) + ".txt?an=iosQiuTan&av=5.9&from=2&r=1494229747"


        print url
    except:
        pass
    resultStr = ''
    # req = urllib2.Request(url)
    # req.add_header("User-Agent", "Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; Trident/4.0)")
    response = requests.get(url)
    # response = urllib2.urlopen(req)
    if response.ok:
        resultStr = response.content;
    else:
        pass

    AllGames = []
    AllBeginTimes = []
    resultStr = '西甲^31^1!中超^60^1!法乙^12^1!西乙^33^1!比甲^5^1!芬超^13^1!日职联^25^1!美职业^21^1!阿甲^2^1!苏冠^150^1!自由杯^89^1!芬甲^212^1!挪甲^123^1!奥乙^128^1!爱超^1^1!爱甲^139^1!波兰超^6^1!罗甲^124^1!斯伐超^132^1!巴西乙^358^1!土超^30^1!保超^131^1!埃及超^303^1!巴拉甲^354^1!委內超^391^1!智利甲^415^1!阿美超^469^1!墨西联^140^1$$1355102^60^0^20170519180000^^北京中赫国安^广州富力^0^0^^^0^0^0^0^0.5^^^1^6^3^^^0^0^0^0^1^^0^0^2.5^8.5!1350368^25^0^20170519180000^^鹿岛鹿角^川崎前锋^0^0^^^0^0^0^0^0.5^^^1^4^7^^^1^0^0^0^1^^0^0^2.5^9.5!1355103^60^0^20170519200000^^广州恒大淘宝^江苏苏宁^0^0^^^0^0^0^0^1.25^^^0^1^14^^^0^0^0^0^1^^0^0^3^9!1287377^469^0^20170519210000^^班南特斯^艾拉斯克特^0^0^^^0^0^0^0^-1.25^^^0^5^1^^^0^0^0^0^1^^0^0^2.5^8!1357046^13^0^20170519230000^^PS凯米^赫尔辛基^0^0^^^0^0^0^0^-1.75^^^0^11^1^^^0^0^0^0^1^^0^0^2.75^9!1367717^124^0^20170519230000^^潘杜里^塔古穆里斯^0^0^^^0^0^0^0^1.25^^^0^7^8^^^0^0^0^0^1^^0^0^2.5^8.5!1359476^303^0^20170519230000^^伊斯梅利^肯特拉特斯^0^0^^^0^0^0^0^0.5^^^0^7^11^^^0^0^0^0^1^^0^0^2^10!1357047^13^0^20170519233000^^HIFK足球^玛丽港^0^0^^^0^0^0^0^-0.25^^^0^10^5^^^0^0^0^0^1^^0^0^2.25^9!1357048^13^0^20170519233000^^埃尔维斯^英特土尔库^0^0^^^0^0^0^0^0.25^^^0^4^8^^^0^0^0^0^0^^0^0^2.25^!1357049^13^0^20170519233000^^拉赫蒂^古比斯^0^0^^^0^0^0^0^0.25^^^0^6^3^^^0^0^0^0^1^^0^0^2.25^9!1357050^13^0^20170519233000^^韦斯屈莱^VPS瓦萨^0^0^^^0^0^0^0^-0.75^^^0^12^2^^^0^0^0^0^1^^0^0^2.25^8.5!1352475^212^0^20170519233000^^EIF埃克纳斯^洪卡^0^0^^^0^0^0^0^-1.25^^^0^10^2^^^0^0^0^0^0^^0^0^3^!1264143^132^0^20170519233000^^波德布雷佐瓦^鲁森比洛克^0^0^^^0^0^0^0^0.25^^^0^4^3^^^0^0^0^0^1^^0^0^2.25^10!1264144^132^0^20170519233000^^扑雷索夫^斯特里达^0^0^^^0^0^0^0^-1^^^0^12^5^^^0^0^0^0^1^^0^0^2.25^10!1264145^132^0^20170519233000^^塞尼察^泰拿华斯巴达^0^0^^^0^0^0^0^-0.25^^^0^10^6^^^0^0^0^0^1^^0^0^2.25^9.5!1264146^132^0^20170519233000^^特伦辛^布拉迪斯拉发^0^0^^^0^0^0^0^0.5^^^0^7^2^^^0^0^0^0^1^^0^0^2.75^10!1264147^132^0^20170519233000^^莫拉斯^斯利纳^0^0^^^0^0^0^0^-0.75^^^0^11^1^^^0^0^0^0^1^^0^0^2.75^10.5!1383436^6^0^20170519235900^^史拉斯科^阿尔卡^0^0^^^0^0^0^0^0.5^^^0^7^6^^^0^0^0^0^1^^0^0^2.5^9.5!1357051^13^0^20170520010000^^塞那乔其^洛瓦涅米^0^0^^^0^0^0^0^0.75^^^0^9^7^^^0^0^0^0^1^^0^0^2.25^9!1338109^123^0^20170520010000^^莫达伦^桑德尼斯^0^0^^^0^0^0^0^0.25^^^0^5^4^^^0^0^0^0^1^^0^0^2.75^10!1277609^30^0^20170520010000^^加拉塔萨雷^奥斯曼里士邦^0^0^^^0^0^0^0^1.25^^^0^4^13^^^0^0^0^0^1^^0^0^3^9.5!1388888^131^0^20170520010000^^贝尔罗^普罗夫迪夫博特夫^0^0^^^0^0^0^0^0.5^^^0^2^2^^^0^0^0^0^0^^0^0^2.25^!1251434^128^0^20170520013000^^列弗宁^华顿斯^0^0^^^0^0^0^0^0.5^^^0^2^5^^^0^0^0^0^1^^0^0^3^10.5!1251435^128^0^20170520013000^^LASK林茨^FAC维也纳^0^0^^^0^0^0^0^0.75^^^0^1^9^^^0^0^0^0^1^^0^0^3^10.5!1251436^128^0^20170520013000^^瓦克蒂罗尔^SV霍恩^0^0^^^0^0^0^0^0.5^^^0^4^10^^^0^0^0^0^1^^0^0^2.75^10!1251437^128^0^20170520013000^^奥地利卢斯特瑙^马纳^0^0^^^0^0^0^0^0.75^^^0^3^8^^^0^0^0^0^1^^0^0^2.75^10.5!1251438^128^0^20170520013000^^卡芬堡^BW林茨^0^0^^^0^0^0^0^0^^^0^6^7^^^0^0^0^0^1^^0^0^2.5^10.5!1367719^124^0^20170520013000^^CSMS雅西^梅迪亚什沼气^0^0^^^0^0^0^0^0.25^^^0^1^5^^^0^0^0^0^1^^0^0^2.25^9!1389028^131^0^20170520013000^^韦列亚^比林^0^0^^^0^0^0^0^^^^0^10^9^^^0^0^0^0^0^^0^0^^!1359475^303^0^20170520013000^^纳塞塔亚登^霍尔比^0^0^^^0^0^0^0^0.25^^^0^17^13^^^0^0^0^0^0^^0^0^2.25^!1269319^33^0^20170520020000^^巴列卡诺^塔拉戈纳^0^0^^^0^0^0^0^0.5^^^0^14^18^^^0^0^0^0^1^^0^0^2.25^10!1249266^12^0^20170520023000^^阿雅克肖^图尔^0^0^^^0^0^0^0^0.25^^^0^13^16^^^0^0^0^0^1^^0^0^2.5^9!1249267^12^0^20170520023000^^欧塞尔^红星^0^0^^^0^0^0^0^0.5^^^0^17^19^^^0^0^0^0^1^^0^0^2.5^9.5!1249268^12^0^20170520023000^^布雷斯特^GFC阿雅克肖^0^0^^^0^0^0^0^1.5^^^0^5^9^^^0^0^0^0^1^^0^0^2.75^9!1249269^12^0^20170520023000^^克莱蒙^瓦朗谢纳^0^0^^^0^0^0^0^0.25^^^0^15^12^^^0^0^0^0^1^^0^0^2.75^9!1249270^12^0^20170520023000^^拉瓦勒^尼姆^0^0^^^0^0^0^0^-0.75^^^0^20^6^^^0^0^0^0^1^^0^0^2.75^9!1249271^12^0^20170520023000^^勒阿弗尔^奥兰斯^0^0^^^0^0^0^0^0^^^0^8^18^^^0^0^0^0^1^^0^0^2.5^9.5!1249272^12^0^20170520023000^^朗斯^尼奥特^0^0^^^0^0^0^0^1.75^^^0^4^10^^^0^0^0^0^1^^0^0^2.75^9.5!1249273^12^0^20170520023000^^兰斯^亚眠^0^0^^^0^0^0^0^-0.75^^^0^7^2^^^0^0^0^0^1^^0^0^2.75^9.5!1249274^12^0^20170520023000^^索肖^特鲁瓦^0^0^^^0^0^0^0^-0.75^^^0^11^3^^^0^0^0^0^1^^0^0^2.75^9.5!1249275^12^0^20170520023000^^斯特拉斯堡^普瑞兰斯^0^0^^^0^0^0^0^2^^^0^1^14^^^0^0^0^0^1^^0^0^3.5^9!1371397^5^0^20170520023000^^圣图尔登^梅赫伦^0^0^^^0^0^0^0^0.25^^^0^1^2^^^0^0^0^0^1^^0^0^2.5^9!1371398^5^0^20170520023000^^标准列日^利尔斯^0^0^^^0^0^0^0^1.25^^^0^4^6^^^0^0^0^0^1^^0^0^3^9!1371399^5^0^20170520023000^^圣吉罗斯^华斯兰德^0^0^^^0^0^0^0^0^^^0^5^3^^^0^0^0^0^1^^0^0^2.5^9!1383437^6^0^20170520023000^^克拉科维亚^罗切霍茹夫^0^0^^^0^0^0^0^0.75^^^0^5^8^^^0^0^0^0^1^^0^0^2.5^10!1268385^31^0^20170520024500^^格拉那达^西班牙人^0^0^^^0^0^0^0^-0.5^^^0^20^10^^^0^0^0^0^1^^0^0^2.75^9!1388321^150^0^20170520024500^^法基克^邓迪联队^0^0^^^0^0^0^0^0.25^^^0^2^3^^^0^0^0^0^1^^0^0^2.5^10.5!1340166^1^0^20170520024500^^利默里克^登克尔克^0^0^^^0^0^0^0^-0.5^^^0^6^3^^^0^0^0^0^1^^0^0^2.75^9.5!1340167^1^0^20170520024500^^布雷^波希米亚人^0^0^^^0^0^0^0^0.75^^^0^2^10^^^0^0^0^0^1^^0^0^2.5^9!1340168^1^0^20170520024500^^圣帕特里克^斯莱戈流浪^0^0^^^0^0^0^0^0.5^^^0^8^9^^^0^0^0^0^1^^0^0^2.5^9!1340169^1^0^20170520024500^^SD戈尔韦^费恩夏普^0^0^^^0^0^0^0^0.5^^^0^11^12^^^0^0^0^0^1^^0^0^2.25^9!1340170^1^0^20170520024500^^德利城^沙姆洛克流浪^0^0^^^0^0^0^0^0.25^^^0^4^5^^^0^0^0^0^1^^0^0^2.5^8.5!1340171^1^0^20170520024500^^科克城^德罗赫达联^0^0^^^0^0^0^0^2^^^0^1^7^^^0^0^0^0^1^^0^0^3.25^9!1347751^139^0^20170520024500^^都柏林大学^科布漫步者^0^0^^^0^0^0^0^0.5^^^0^2^3^^^0^0^0^0^0^^0^0^2.5^!1347752^139^0^20170520024500^^沃特福德联队^朗福德城^0^0^^^0^0^0^0^0.75^^^0^1^6^^^0^0^0^0^0^^0^0^2.25^!1269323^33^0^20170520030000^^赫塔菲^艾尔切^0^0^^^0^0^0^0^0.75^^^0^3^20^^^0^0^0^0^1^^0^0^2.25^9.5!1347753^139^0^20170520030000^^韦克斯福德青年^谢尔伯恩^0^0^^^0^0^0^0^-0.5^^^0^8^4^^^0^0^0^0^0^^0^0^2.5^!1348222^391^0^20170520040000^^苏利亚^塔赤雷^0^0^^^0^0^0^0^^^^0^9^1^^^0^0^0^0^0^^0^0^^!1341172^354^0^20170520050000^^迪亚兹^鲁毕奥^0^0^^^0^0^0^0^^^^0^7^9^^^0^0^0^0^0^^0^0^^!1374069^358^0^20170520061500^^巴拉纳^帕桑度^0^0^^^0^0^0^0^0.25^^^0^1^3^^^0^0^0^0^1^^0^0^2.25^10.5!1341171^354^0^20170520071000^^卢捷诺体育会^卡比亚塔^0^0^^^0^0^0^0^^^^0^11^10^^^0^0^0^0^0^^0^0^^!1344184^21^0^20170520073000^^纽约红牛^多伦多FC^0^0^^^0^0^0^0^0.25^^^0^11^2^^^1^0^0^0^1^^0^0^2.75^9.5!1374068^358^0^20170520073000^^维拉诺瓦^尤文图德^0^0^^^0^0^0^0^0.25^^^0^9^5^^^0^0^0^0^1^^0^0^2.25^10!1363897^415^0^20170520073000^^西班牙联合^奥达斯^0^0^^^0^0^0^0^0.5^^^0^6^8^^^0^0^0^0^1^^0^0^3^9.5!1292466^2^0^20170520081500^^图库曼竞技^班菲尔德^0^0^^^0^0^0^0^0^^^0^18^5^^^0^0^0^0^1^^0^0^2.25^9.5!1374067^358^0^20170520083000^^米内罗美洲^戈伊亚斯^0^0^^^0^0^0^0^0.25^^^0^13^10^^^0^0^0^0^1^^0^0^2.25^10!1366282^89^-1^20170519080000^20170519090255^梅尔加^河床^2^3^1^2^0^0^1^1^0^^^1^1^3^^^0^0^7^9^1^^4^5^2.75^9!1388403^140^-1^20170519083000^20170519093728^托卢卡^瓜达拉哈拉^1^1^0^0^0^0^2^1^0.25^^^1^4^3^^^0^0^5^4^1^^1^4^2.25^10!1366258^89^-1^20170519084500^20170519094723^博塔弗戈^国民竞技^1^0^0^0^0^0^1^1^0.25^^^1^16^1^^^1^0^7^6^1^^2^2^2.25^9!1388404^140^-1^20170519103000^20170519113519^泰格雷斯^提华纳^2^0^2^0^0^0^3^1^0.75^^^1^7^1^^^0^0^4^2^1^^3^0^2.5^9.5'
    if resultStr != '':
        # print resultStr
        allArray = resultStr.split('$$')
        leagueStr = ''
        if type == 1:
            leagueStr = allArray[0]
        else:
            leagueStr = allArray[1]

        allLeague = leagueStr.split('!')
        dic = {}
        for league in allLeague:
            oneLeague = league.split('^')
            dic[oneLeague[1]] = oneLeague[0]

        gameStr = ''
        if type == 1:
            gameStr = allArray[1]
        else:
            gameStr = allArray[2]

        games = gameStr.split('!')
        contentStr = ''
        for game in games:
            onegame = FootballGame()
            oneGameArray = game.split('^')
            oneGameArray.remove('')
            onegame.soccerID = int(oneGameArray[0])
            onegame.leauge = dic.get(oneGameArray[1].encode('utf-8'))
            beginTime = oneGameArray[3].encode('utf-8')
            onegame.beginTime = beginTime[0:4] + '-' + beginTime[4:6] + '-' + beginTime[6:8] + ' ' + beginTime[8:10] + ':' + beginTime[10:12]


            briefTimeStr = beginTime[0:4] + '-' + beginTime[4:6] + '-' + beginTime[6:8] + ' ' + beginTime[8:10] + ':' + beginTime[10:12]
            if briefTimeStr not in AllBeginTimes:
                AllBeginTimes.append(briefTimeStr)

            if oneGameArray[4].isdigit() or oneGameArray[4] == '':
                onegame.homeTeam = oneGameArray[5].encode('utf-8')
                onegame.friendTeam = oneGameArray[6].encode('utf-8')
            else:
                onegame.homeTeam = oneGameArray[4].encode('utf-8')
                onegame.friendTeam = oneGameArray[5].encode('utf-8')

            AllGames.append(onegame)

            onegame.oddCompanies = getOneGameODD(onegame)
            onegame.handiCompanies = getOneGameHandi(onegame)
            # templist = getexchange(onegame.soccerID)
            tempstr = getGameData(onegame)
            if tempstr != None:
                contentStr = contentStr + tempstr
                contentStr = contentStr + '\n'
                # contentStr = contentStr.join(templist)
            time.sleep(3)

        i = datetime.now()

        if type == 1:
            subjectstr = '精简足球分析'
        elif type == 2:
            subjectstr = '十四场足球分析'
        else:
            subjectstr = '竞彩分析'

        send_mail("%s %s/%s/%s" % (subjectstr, i.year, i.month, i.day), contentStr)
        # if type == 1 or type == 3:
        #     runTask(anyaisegame, AllGames, AllBeginTimes)


# if sys.argv.__len__()==1:
#     sys.exit('\033[0;36;40m使用说明:\n1个参数:\n1:精简足球分析   2:十四场足球分析  3:竞彩分析\n事例: python TodaySoccer.pyc 1\033[0m')
#
# if __name__ == '__main__':
#     getTodaySoccer(sys.argv[1])
getTodaySoccer(1)




# getexchange(1255863)